rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/*
** ###################################################################
**     Processor:           S32K388_M7
**     Reference manual:    S32K3xx RM Rev.8 Draft B
**     Version:             rev. 1.3, 2023-09-12
**     Build:               b230922
**
**     Abstract:
**         Peripheral Access Layer for S32K388_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2023 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K388_VIRT_WRAPPER.h
 * @version 1.3
 * @date 2023-09-12
 * @brief Peripheral Access Layer for S32K388_VIRT_WRAPPER
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K388_VIRT_WRAPPER_H_)  /* Check if memory map has not been already included */
#define S32K388_VIRT_WRAPPER_H_

#include "S32K388_COMMON.h"

/* ----------------------------------------------------------------------------
   -- VIRT_WRAPPER Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VIRT_WRAPPER_Peripheral_Access_Layer VIRT_WRAPPER Peripheral Access Layer
 * @{
 */

/** VIRT_WRAPPER - Size of Registers Arrays */
#define VIRT_WRAPPER_REG_C_COUNT                  1u
#define VIRT_WRAPPER_REG_D_COUNT                  1u

/** VIRT_WRAPPER - Register Layout Typedef */
typedef struct {
  __IO uint32_t REG_A3_0;                          /**< Parameter_n Register, offset: 0x0 */
  __IO uint32_t REG_A7_4;                          /**< Parameter_n Register, offset: 0x4 */
  __IO uint32_t REG_A11_8;                         /**< Parameter_n Register, offset: 0x8 */
  __IO uint32_t REG_A15_12;                        /**< Parameter_n Register, offset: 0xC */
  __IO uint32_t REG_A19_16;                        /**< Parameter_n Register, offset: 0x10 */
  __IO uint32_t REG_A23_20;                        /**< Parameter_n Register, offset: 0x14 */
  __IO uint32_t REG_A27_24;                        /**< Parameter_n Register, offset: 0x18 */
  __IO uint32_t REG_A31_28;                        /**< Parameter_n Register, offset: 0x1C */
  __IO uint32_t REG_A35_32;                        /**< Parameter_n Register, offset: 0x20 */
  __IO uint32_t REG_A39_36;                        /**< Parameter_n Register, offset: 0x24 */
  __IO uint32_t REG_A43_40;                        /**< Parameter_n Register, offset: 0x28 */
  __IO uint32_t REG_A47_44;                        /**< Parameter_n Register, offset: 0x2C */
  __IO uint32_t REG_A51_48;                        /**< Parameter_n Register, offset: 0x30 */
  __IO uint32_t REG_A55_52;                        /**< Parameter_n Register, offset: 0x34 */
  __IO uint32_t REG_A59_56;                        /**< Parameter_n Register, offset: 0x38 */
  __IO uint32_t REG_A63_60;                        /**< Parameter_n Register, offset: 0x3C */
  __IO uint32_t REG_A67_64;                        /**< Parameter_n Register, offset: 0x40 */
  __IO uint32_t REG_A71_68;                        /**< Parameter_n Register, offset: 0x44 */
  __IO uint32_t REG_A75_72;                        /**< Parameter_n Register, offset: 0x48 */
  __IO uint32_t REG_A79_76;                        /**< Parameter_n Register, offset: 0x4C */
  __IO uint32_t REG_A83_80;                        /**< Parameter_n Register, offset: 0x50 */
  __IO uint32_t REG_A87_84;                        /**< Parameter_n Register, offset: 0x54 */
  __IO uint32_t REG_A91_88;                        /**< Parameter_n Register, offset: 0x58 */
  __IO uint32_t REG_A95_92;                        /**< Parameter_n Register, offset: 0x5C */
  __IO uint32_t REG_A99_96;                        /**< Parameter_n Register, offset: 0x60 */
  __IO uint32_t REG_A103_100;                      /**< Parameter_n Register, offset: 0x64 */
  __IO uint32_t REG_A107_104;                      /**< Parameter_n Register, offset: 0x68 */
  __IO uint32_t REG_A111_108;                      /**< Parameter_n Register, offset: 0x6C */
  __IO uint32_t REG_A115_112;                      /**< Parameter_n Register, offset: 0x70 */
  __IO uint32_t REG_A119_116;                      /**< Parameter_n Register, offset: 0x74 */
  __IO uint32_t REG_A123_120;                      /**< Parameter_n Register, offset: 0x78 */
  __IO uint32_t REG_A127_124;                      /**< Parameter_n Register, offset: 0x7C */
  __IO uint32_t REG_A131_128;                      /**< Parameter_n Register, offset: 0x80 */
  __IO uint32_t REG_A135_132;                      /**< Parameter_n Register, offset: 0x84 */
  __IO uint32_t REG_A139_136;                      /**< Parameter_n Register, offset: 0x88 */
  __IO uint32_t REG_A143_140;                      /**< Parameter_n Register, offset: 0x8C */
  __IO uint32_t REG_A147_144;                      /**< Parameter_n Register, offset: 0x90 */
  __IO uint32_t REG_A151_148;                      /**< Parameter_n Register, offset: 0x94 */
  __IO uint32_t REG_A155_152;                      /**< Parameter_n Register, offset: 0x98 */
  __IO uint32_t REG_A159_156;                      /**< Parameter_n Register, offset: 0x9C */
  __IO uint32_t REG_A163_160;                      /**< Parameter_n Register, offset: 0xA0 */
  __IO uint32_t REG_A167_164;                      /**< Parameter_n Register, offset: 0xA4 */
  __IO uint32_t REG_A171_168;                      /**< Parameter_n Register, offset: 0xA8 */
  __IO uint32_t REG_A175_172;                      /**< Parameter_n Register, offset: 0xAC */
  __IO uint32_t REG_A179_176;                      /**< Parameter_n Register, offset: 0xB0 */
  __IO uint32_t REG_A183_180;                      /**< Parameter_n Register, offset: 0xB4 */
  __IO uint32_t REG_A187_184;                      /**< Parameter_n Register, offset: 0xB8 */
  __IO uint32_t REG_A191_188;                      /**< Parameter_n Register, offset: 0xBC */
  __IO uint32_t REG_A195_192;                      /**< Parameter_n Register, offset: 0xC0 */
  __IO uint32_t REG_A199_196;                      /**< Parameter_n Register, offset: 0xC4 */
  __IO uint32_t REG_A203_200;                      /**< Parameter_n Register, offset: 0xC8 */
  __IO uint32_t REG_A207_204;                      /**< Parameter_n Register, offset: 0xCC */
  __IO uint32_t REG_A211_208;                      /**< Parameter_n Register, offset: 0xD0 */
  __IO uint32_t REG_A215_212;                      /**< Parameter_n Register, offset: 0xD4 */
  __IO uint32_t REG_A219_216;                      /**< Parameter_n Register, offset: 0xD8 */
  __IO uint32_t REG_A223_220;                      /**< Parameter_n Register, offset: 0xDC */
  __IO uint32_t REG_A227_224;                      /**< Parameter_n Register, offset: 0xE0 */
  __IO uint32_t REG_A231_228;                      /**< Parameter_n Register, offset: 0xE4 */
  __IO uint32_t REG_A235_232;                      /**< Parameter_n Register, offset: 0xE8 */
  __IO uint32_t REG_A239_236;                      /**< Parameter_n Register, offset: 0xEC */
  uint8_t RESERVED_0[784];
  __IO uint32_t REG_B3_0;                          /**< Parameter_n Register, offset: 0x400 */
  __IO uint32_t REG_B7_4;                          /**< Parameter_n Register, offset: 0x404 */
  uint8_t RESERVED_1[8];
  __IO uint32_t REG_B19_16;                        /**< Parameter_n Register, offset: 0x410 */
  __IO uint32_t REG_B23_20;                        /**< Parameter_n Register, offset: 0x414 */
  __IO uint32_t REG_B27_24;                        /**< Parameter_n Register, offset: 0x418 */
  __IO uint32_t REG_B31_28;                        /**< Parameter_n Register, offset: 0x41C */
  __IO uint32_t REG_B35_32;                        /**< Parameter_n Register, offset: 0x420 */
  __IO uint32_t REG_B39_36;                        /**< Parameter_n Register, offset: 0x424 */
  __IO uint32_t REG_B43_40;                        /**< Parameter_n Register, offset: 0x428 */
  __IO uint32_t REG_B47_44;                        /**< Parameter_n Register, offset: 0x42C */
  __IO uint32_t REG_B51_48;                        /**< Parameter_n Register, offset: 0x430 */
  __IO uint32_t REG_B55_52;                        /**< Parameter_n Register, offset: 0x434 */
  __IO uint32_t REG_B59_56;                        /**< Parameter_n Register, offset: 0x438 */
  __IO uint32_t REG_B63_60;                        /**< Parameter_n Register, offset: 0x43C */
  __IO uint32_t REG_B67_64;                        /**< Parameter_n Register, offset: 0x440 */
  __IO uint32_t REG_B71_68;                        /**< Parameter_n Register, offset: 0x444 */
  uint8_t RESERVED_2[8];
  __IO uint32_t REG_B83_80;                        /**< Parameter_n Register, offset: 0x450 */
  __IO uint32_t REG_B87_84;                        /**< Parameter_n Register, offset: 0x454 */
  __IO uint32_t REG_B91_88;                        /**< Parameter_n Register, offset: 0x458 */
  __IO uint32_t REG_B95_92;                        /**< Parameter_n Register, offset: 0x45C */
  __IO uint32_t REG_B99_96;                        /**< Parameter_n Register, offset: 0x460 */
  __IO uint32_t REG_B103_100;                      /**< Parameter_n Register, offset: 0x464 */
  uint8_t RESERVED_3[8];
  __IO uint32_t REG_B115_112;                      /**< Parameter_n Register, offset: 0x470 */
  __IO uint32_t REG_B119_116;                      /**< Parameter_n Register, offset: 0x474 */
  __IO uint32_t REG_B123_120;                      /**< Parameter_n Register, offset: 0x478 */
  __IO uint32_t REG_B127_124;                      /**< Parameter_n Register, offset: 0x47C */
  __IO uint32_t REG_B131_128;                      /**< Parameter_n Register, offset: 0x480 */
  __IO uint32_t REG_B135_132;                      /**< Parameter_n Register, offset: 0x484 */
  uint8_t RESERVED_4[8];
  __IO uint32_t REG_B147_144;                      /**< Parameter_n Register, offset: 0x490 */
  __IO uint32_t REG_B151_148;                      /**< Parameter_n Register, offset: 0x494 */
  __IO uint32_t REG_B155_152;                      /**< Parameter_n Register, offset: 0x498 */
  __IO uint32_t REG_B159_156;                      /**< Parameter_n Register, offset: 0x49C */
  __IO uint32_t REG_B163_160;                      /**< Parameter_n Register, offset: 0x4A0 */
  __IO uint32_t REG_B167_164;                      /**< Parameter_n Register, offset: 0x4A4 */
  __IO uint32_t REG_B171_168;                      /**< Parameter_n Register, offset: 0x4A8 */
  __IO uint32_t REG_B175_172;                      /**< Parameter_n Register, offset: 0x4AC */
  __IO uint32_t REG_B179_176;                      /**< Parameter_n Register, offset: 0x4B0 */
  __IO uint32_t REG_B183_180;                      /**< Parameter_n Register, offset: 0x4B4 */
  __IO uint32_t REG_B187_184;                      /**< Parameter_n Register, offset: 0x4B8 */
  __IO uint32_t REG_B191_188;                      /**< Parameter_n Register, offset: 0x4BC */
  __IO uint32_t REG_B195_192;                      /**< Parameter_n Register, offset: 0x4C0 */
  __IO uint32_t REG_B199_196;                      /**< Parameter_n Register, offset: 0x4C4 */
  __IO uint32_t REG_B203_200;                      /**< Parameter_n Register, offset: 0x4C8 */
  uint8_t RESERVED_5[4];
  __IO uint32_t REG_B211_208;                      /**< Parameter_n Register, offset: 0x4D0 */
  __IO uint32_t REG_B215_212;                      /**< Parameter_n Register, offset: 0x4D4 */
  __IO uint32_t REG_B219_216;                      /**< Parameter_n Register, offset: 0x4D8 */
  __IO uint32_t REG_B223_220;                      /**< Parameter_n Register, offset: 0x4DC */
  __IO uint32_t REG_B227_224;                      /**< Parameter_n Register, offset: 0x4E0 */
  __IO uint32_t REG_B231_228;                      /**< Parameter_n Register, offset: 0x4E4 */
  __IO uint32_t REG_B235_232;                      /**< Parameter_n Register, offset: 0x4E8 */
  __IO uint32_t REG_B239_236;                      /**< Parameter_n Register, offset: 0x4EC */
  __IO uint32_t REG_B243_240;                      /**< Parameter_n Register, offset: 0x4F0 */
  __IO uint32_t REG_B247_244;                      /**< Parameter_n Register, offset: 0x4F4 */
  __IO uint32_t REG_B251_248;                      /**< Parameter_n Register, offset: 0x4F8 */
  __IO uint32_t REG_B255_252;                      /**< Parameter_n Register, offset: 0x4FC */
  __IO uint32_t REG_B259_256;                      /**< Parameter_n Register, offset: 0x500 */
  __IO uint32_t REG_B263_260;                      /**< Parameter_n Register, offset: 0x504 */
  __IO uint32_t REG_B267_264;                      /**< Parameter_n Register, offset: 0x508 */
  __IO uint32_t REG_B271_268;                      /**< Parameter_n Register, offset: 0x50C */
  uint8_t RESERVED_6[16];
  __IO uint32_t REG_B291_288;                      /**< Parameter_n Register, offset: 0x520 */
  __IO uint32_t REG_B295_292;                      /**< Parameter_n Register, offset: 0x524 */
  __IO uint32_t REG_B299_296;                      /**< Parameter_n Register, offset: 0x528 */
  __IO uint32_t REG_B303_300;                      /**< Parameter_n Register, offset: 0x52C */
  __IO uint32_t REG_B307_304;                      /**< Parameter_n Register, offset: 0x530 */
  __IO uint32_t REG_B311_308;                      /**< Parameter_n Register, offset: 0x534 */
  __IO uint32_t REG_B315_312;                      /**< Parameter_n Register, offset: 0x538 */
  __IO uint32_t REG_B319_316;                      /**< Parameter_n Register, offset: 0x53C */
  __IO uint32_t REG_B323_320;                      /**< Parameter_n Register, offset: 0x540 */
  __IO uint32_t REG_B327_324;                      /**< Parameter_n Register, offset: 0x544 */
  uint8_t RESERVED_7[12];
  __IO uint32_t REG_B343_340;                      /**< Parameter_n Register, offset: 0x554 */
  __IO uint32_t REG_B347_344;                      /**< Parameter_n Register, offset: 0x558 */
  __IO uint32_t REG_B351_348;                      /**< Parameter_n Register, offset: 0x55C */
  __IO uint32_t REG_B355_352;                      /**< Parameter_n Register, offset: 0x560 */
  __IO uint32_t REG_B359_356;                      /**< Parameter_n Register, offset: 0x564 */
  __IO uint32_t REG_B363_360;                      /**< Parameter_n Register, offset: 0x568 */
  __IO uint32_t REG_B367_364;                      /**< Parameter_n Register, offset: 0x56C */
  __IO uint32_t REG_B371_368;                      /**< Parameter_n Register, offset: 0x570 */
  __IO uint32_t REG_B375_372;                      /**< Parameter_n Register, offset: 0x574 */
  __IO uint32_t REG_B379_376;                      /**< Parameter_n Register, offset: 0x578 */
  uint8_t RESERVED_8[8];
  __IO uint32_t REG_B391_388;                      /**< Parameter_n Register, offset: 0x584 */
  uint8_t RESERVED_9[4];
  __IO uint32_t REG_B399_396;                      /**< Parameter_n Register, offset: 0x58C */
  uint8_t RESERVED_10[8];
  __IO uint32_t REG_B411_408;                      /**< Parameter_n Register, offset: 0x598 */
  __IO uint32_t REG_B415_412;                      /**< Parameter_n Register, offset: 0x59C */
  __IO uint32_t REG_B419_416;                      /**< Parameter_n Register, offset: 0x5A0 */
  uint8_t RESERVED_11[20];
  __IO uint32_t REG_B443_440;                      /**< Parameter_n Register, offset: 0x5B8 */
  uint8_t RESERVED_12[4];
  __IO uint32_t REG_B451_448;                      /**< Parameter_n Register, offset: 0x5C0 */
  __IO uint32_t REG_B455_452;                      /**< Parameter_n Register, offset: 0x5C4 */
  __IO uint32_t REG_B459_456;                      /**< Parameter_n Register, offset: 0x5C8 */
  __IO uint32_t REG_B463_460;                      /**< Parameter_n Register, offset: 0x5CC */
  __IO uint32_t REG_B467_464;                      /**< Parameter_n Register, offset: 0x5D0 */
  __IO uint32_t REG_B471_468;                      /**< Parameter_n Register, offset: 0x5D4 */
  uint8_t RESERVED_13[552];
  __IO uint32_t REG_C[VIRT_WRAPPER_REG_C_COUNT];   /**< Parameter_n Register, array offset: 0x800, array step: 0x4 */
  uint8_t RESERVED_14[1020];
  __IO uint32_t REG_D[VIRT_WRAPPER_REG_D_COUNT];   /**< Parameter_n Register, array offset: 0xC00, array step: 0x4 */
} VIRT_WRAPPER_Type, *VIRT_WRAPPER_MemMapPtr;

/** Number of instances of the VIRT_WRAPPER module. */
#define VIRT_WRAPPER_INSTANCE_COUNT              (1u)

