rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/* VIRT_WRAPPER - Peripheral instance base addresses */
/** Peripheral VIRT_WRAPPER base address */
#define IP_VIRT_WRAPPER_BASE                     (0x402A8000u)
/** Peripheral VIRT_WRAPPER base pointer */
#define IP_VIRT_WRAPPER                          ((VIRT_WRAPPER_Type *)IP_VIRT_WRAPPER_BASE)
/** Array initializer of VIRT_WRAPPER peripheral base addresses */
#define IP_VIRT_WRAPPER_BASE_ADDRS               { IP_VIRT_WRAPPER_BASE }
/** Array initializer of VIRT_WRAPPER peripheral base pointers */
#define IP_VIRT_WRAPPER_BASE_PTRS                { IP_VIRT_WRAPPER }

/* ----------------------------------------------------------------------------
   -- VIRT_WRAPPER Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VIRT_WRAPPER_Register_Masks VIRT_WRAPPER Register Masks
 * @{
 */

/*! @name REG_A3_0 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A3_0_PAD_0_MASK         (0x7U)
#define VIRT_WRAPPER_REG_A3_0_PAD_0_SHIFT        (0U)
#define VIRT_WRAPPER_REG_A3_0_PAD_0_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A3_0_PAD_0(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A3_0_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A3_0_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A3_0_PAD_1_MASK         (0x700U)
#define VIRT_WRAPPER_REG_A3_0_PAD_1_SHIFT        (8U)
#define VIRT_WRAPPER_REG_A3_0_PAD_1_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A3_0_PAD_1(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A3_0_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A3_0_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A3_0_PAD_2_MASK         (0x70000U)
#define VIRT_WRAPPER_REG_A3_0_PAD_2_SHIFT        (16U)
#define VIRT_WRAPPER_REG_A3_0_PAD_2_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A3_0_PAD_2(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A3_0_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A3_0_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A3_0_PAD_3_MASK         (0x7000000U)
#define VIRT_WRAPPER_REG_A3_0_PAD_3_SHIFT        (24U)
#define VIRT_WRAPPER_REG_A3_0_PAD_3_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A3_0_PAD_3(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A3_0_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A3_0_PAD_3_MASK)
/*! @} */

/*! @name REG_A7_4 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A7_4_PAD_0_MASK         (0x7U)
#define VIRT_WRAPPER_REG_A7_4_PAD_0_SHIFT        (0U)
#define VIRT_WRAPPER_REG_A7_4_PAD_0_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A7_4_PAD_0(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A7_4_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A7_4_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A7_4_PAD_1_MASK         (0x700U)
#define VIRT_WRAPPER_REG_A7_4_PAD_1_SHIFT        (8U)
#define VIRT_WRAPPER_REG_A7_4_PAD_1_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A7_4_PAD_1(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A7_4_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A7_4_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A7_4_PAD_2_MASK         (0x70000U)
#define VIRT_WRAPPER_REG_A7_4_PAD_2_SHIFT        (16U)
#define VIRT_WRAPPER_REG_A7_4_PAD_2_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A7_4_PAD_2(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A7_4_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A7_4_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A7_4_PAD_3_MASK         (0x7000000U)
#define VIRT_WRAPPER_REG_A7_4_PAD_3_SHIFT        (24U)
#define VIRT_WRAPPER_REG_A7_4_PAD_3_WIDTH        (3U)
#define VIRT_WRAPPER_REG_A7_4_PAD_3(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A7_4_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A7_4_PAD_3_MASK)
/*! @} */

/*! @name REG_A11_8 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A11_8_PAD_0_MASK        (0x7U)
#define VIRT_WRAPPER_REG_A11_8_PAD_0_SHIFT       (0U)
#define VIRT_WRAPPER_REG_A11_8_PAD_0_WIDTH       (3U)
#define VIRT_WRAPPER_REG_A11_8_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A11_8_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A11_8_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A11_8_PAD_1_MASK        (0x700U)
#define VIRT_WRAPPER_REG_A11_8_PAD_1_SHIFT       (8U)
#define VIRT_WRAPPER_REG_A11_8_PAD_1_WIDTH       (3U)
#define VIRT_WRAPPER_REG_A11_8_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A11_8_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A11_8_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A11_8_PAD_2_MASK        (0x70000U)
#define VIRT_WRAPPER_REG_A11_8_PAD_2_SHIFT       (16U)
#define VIRT_WRAPPER_REG_A11_8_PAD_2_WIDTH       (3U)
#define VIRT_WRAPPER_REG_A11_8_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A11_8_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A11_8_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A11_8_PAD_3_MASK        (0x7000000U)
#define VIRT_WRAPPER_REG_A11_8_PAD_3_SHIFT       (24U)
#define VIRT_WRAPPER_REG_A11_8_PAD_3_WIDTH       (3U)
#define VIRT_WRAPPER_REG_A11_8_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A11_8_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A11_8_PAD_3_MASK)
/*! @} */

/*! @name REG_A15_12 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A15_12_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A15_12_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A15_12_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A15_12_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A15_12_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A15_12_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A15_12_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A15_12_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A15_12_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A15_12_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A15_12_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A15_12_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A15_12_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A15_12_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A15_12_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A15_12_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A15_12_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A15_12_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A15_12_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A15_12_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A15_12_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A15_12_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A15_12_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A15_12_PAD_3_MASK)
/*! @} */

/*! @name REG_A19_16 - Parameter_n Register */
/*! @{ */

