rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_A19_16_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A19_16_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A19_16_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A19_16_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A19_16_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A19_16_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A19_16_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A19_16_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A19_16_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A19_16_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A19_16_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A19_16_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A19_16_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A19_16_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A19_16_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A19_16_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A19_16_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A19_16_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A19_16_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A19_16_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A19_16_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A19_16_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A19_16_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A19_16_PAD_3_MASK)
/*! @} */

/*! @name REG_A23_20 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A23_20_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A23_20_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A23_20_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A23_20_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A23_20_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A23_20_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A23_20_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A23_20_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A23_20_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A23_20_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A23_20_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A23_20_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A23_20_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A23_20_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A23_20_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A23_20_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A23_20_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A23_20_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A23_20_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A23_20_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A23_20_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A23_20_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A23_20_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A23_20_PAD_3_MASK)
/*! @} */

/*! @name REG_A27_24 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A27_24_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A27_24_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A27_24_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A27_24_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A27_24_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A27_24_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A27_24_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A27_24_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A27_24_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A27_24_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A27_24_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A27_24_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A27_24_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A27_24_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A27_24_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A27_24_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A27_24_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A27_24_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A27_24_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A27_24_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A27_24_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A27_24_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A27_24_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A27_24_PAD_3_MASK)
/*! @} */

/*! @name REG_A31_28 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A31_28_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A31_28_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A31_28_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A31_28_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A31_28_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A31_28_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A31_28_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A31_28_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A31_28_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A31_28_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A31_28_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A31_28_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A31_28_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A31_28_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A31_28_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A31_28_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A31_28_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A31_28_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A31_28_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A31_28_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A31_28_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A31_28_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A31_28_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A31_28_PAD_3_MASK)
/*! @} */

/*! @name REG_A35_32 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A35_32_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A35_32_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A35_32_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A35_32_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A35_32_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A35_32_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A35_32_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A35_32_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A35_32_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A35_32_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A35_32_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A35_32_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A35_32_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A35_32_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A35_32_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A35_32_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A35_32_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A35_32_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A35_32_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A35_32_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A35_32_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A35_32_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A35_32_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A35_32_PAD_3_MASK)
/*! @} */

/*! @name REG_A39_36 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A39_36_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A39_36_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A39_36_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A39_36_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A39_36_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A39_36_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A39_36_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A39_36_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A39_36_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A39_36_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A39_36_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A39_36_PAD_1_MASK)
/*! @} */

