rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/*! @name REG_A43_40 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A43_40_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A43_40_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A43_40_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A43_40_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A43_40_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A43_40_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A43_40_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A43_40_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A43_40_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A43_40_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A43_40_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A43_40_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A43_40_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A43_40_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A43_40_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A43_40_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A43_40_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A43_40_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A43_40_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A43_40_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A43_40_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A43_40_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A43_40_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A43_40_PAD_3_MASK)
/*! @} */

/*! @name REG_A47_44 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A47_44_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A47_44_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A47_44_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A47_44_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A47_44_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A47_44_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A47_44_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A47_44_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A47_44_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A47_44_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A47_44_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A47_44_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A47_44_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A47_44_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A47_44_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A47_44_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A47_44_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A47_44_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A47_44_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A47_44_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A47_44_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A47_44_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A47_44_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A47_44_PAD_3_MASK)
/*! @} */

/*! @name REG_A51_48 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A51_48_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A51_48_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A51_48_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A51_48_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A51_48_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A51_48_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A51_48_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A51_48_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A51_48_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A51_48_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A51_48_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A51_48_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A51_48_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A51_48_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A51_48_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A51_48_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A51_48_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A51_48_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A51_48_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A51_48_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A51_48_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A51_48_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A51_48_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A51_48_PAD_3_MASK)
/*! @} */

/*! @name REG_A55_52 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A55_52_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A55_52_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A55_52_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A55_52_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A55_52_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A55_52_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A55_52_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A55_52_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A55_52_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A55_52_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A55_52_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A55_52_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A55_52_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A55_52_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A55_52_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A55_52_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A55_52_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A55_52_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A55_52_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A55_52_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A55_52_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A55_52_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A55_52_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A55_52_PAD_3_MASK)
/*! @} */

/*! @name REG_A59_56 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A59_56_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A59_56_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A59_56_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A59_56_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A59_56_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A59_56_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A59_56_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A59_56_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A59_56_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A59_56_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A59_56_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A59_56_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A59_56_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A59_56_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A59_56_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A59_56_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A59_56_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A59_56_PAD_2_MASK)

