rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_A79_76_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A79_76_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A79_76_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A79_76_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A79_76_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A79_76_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A79_76_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A79_76_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A79_76_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A79_76_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A79_76_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A79_76_PAD_3_MASK)
/*! @} */

/*! @name REG_A83_80 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A83_80_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A83_80_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A83_80_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A83_80_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A83_80_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A83_80_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A83_80_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A83_80_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A83_80_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A83_80_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A83_80_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A83_80_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A83_80_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A83_80_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A83_80_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A83_80_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A83_80_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A83_80_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A83_80_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A83_80_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A83_80_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A83_80_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A83_80_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A83_80_PAD_3_MASK)
/*! @} */

/*! @name REG_A87_84 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A87_84_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A87_84_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A87_84_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A87_84_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A87_84_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A87_84_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A87_84_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A87_84_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A87_84_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A87_84_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A87_84_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A87_84_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A87_84_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A87_84_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A87_84_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A87_84_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A87_84_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A87_84_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A87_84_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A87_84_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A87_84_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A87_84_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A87_84_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A87_84_PAD_3_MASK)
/*! @} */

/*! @name REG_A91_88 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A91_88_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A91_88_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A91_88_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A91_88_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A91_88_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A91_88_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A91_88_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A91_88_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A91_88_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A91_88_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A91_88_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A91_88_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A91_88_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A91_88_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A91_88_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A91_88_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A91_88_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A91_88_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A91_88_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A91_88_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A91_88_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A91_88_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A91_88_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A91_88_PAD_3_MASK)
/*! @} */

/*! @name REG_A95_92 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A95_92_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A95_92_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A95_92_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A95_92_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A95_92_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A95_92_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A95_92_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A95_92_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A95_92_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A95_92_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A95_92_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A95_92_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A95_92_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A95_92_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A95_92_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A95_92_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A95_92_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A95_92_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A95_92_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A95_92_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A95_92_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A95_92_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A95_92_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A95_92_PAD_3_MASK)
/*! @} */

/*! @name REG_A99_96 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A99_96_PAD_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_A99_96_PAD_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_A99_96_PAD_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A99_96_PAD_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A99_96_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A99_96_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A99_96_PAD_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_A99_96_PAD_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_A99_96_PAD_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A99_96_PAD_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A99_96_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A99_96_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A99_96_PAD_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_A99_96_PAD_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_A99_96_PAD_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A99_96_PAD_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A99_96_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A99_96_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A99_96_PAD_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_A99_96_PAD_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_A99_96_PAD_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_A99_96_PAD_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A99_96_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A99_96_PAD_3_MASK)
/*! @} */

/*! @name REG_A103_100 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A103_100_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A103_100_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A103_100_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A103_100_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A103_100_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A103_100_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A103_100_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A103_100_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A103_100_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A103_100_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A103_100_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A103_100_PAD_1_MASK)

