rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_A103_100_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A103_100_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A103_100_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A103_100_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A103_100_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A103_100_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A103_100_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A103_100_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A103_100_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A103_100_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A103_100_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A103_100_PAD_3_MASK)
/*! @} */

/*! @name REG_A107_104 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A107_104_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A107_104_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A107_104_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A107_104_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A107_104_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A107_104_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A107_104_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A107_104_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A107_104_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A107_104_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A107_104_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A107_104_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A107_104_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A107_104_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A107_104_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A107_104_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A107_104_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A107_104_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A107_104_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A107_104_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A107_104_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A107_104_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A107_104_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A107_104_PAD_3_MASK)
/*! @} */

/*! @name REG_A111_108 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A111_108_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A111_108_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A111_108_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A111_108_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A111_108_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A111_108_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A111_108_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A111_108_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A111_108_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A111_108_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A111_108_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A111_108_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A111_108_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A111_108_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A111_108_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A111_108_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A111_108_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A111_108_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A111_108_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A111_108_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A111_108_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A111_108_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A111_108_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A111_108_PAD_3_MASK)
/*! @} */

/*! @name REG_A115_112 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A115_112_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A115_112_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A115_112_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A115_112_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A115_112_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A115_112_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A115_112_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A115_112_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A115_112_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A115_112_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A115_112_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A115_112_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A115_112_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A115_112_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A115_112_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A115_112_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A115_112_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A115_112_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A115_112_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A115_112_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A115_112_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A115_112_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A115_112_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A115_112_PAD_3_MASK)
/*! @} */

/*! @name REG_A119_116 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A119_116_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A119_116_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A119_116_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A119_116_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A119_116_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A119_116_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A119_116_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A119_116_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A119_116_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A119_116_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A119_116_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A119_116_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A119_116_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A119_116_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A119_116_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A119_116_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A119_116_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A119_116_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A119_116_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A119_116_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A119_116_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A119_116_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A119_116_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A119_116_PAD_3_MASK)
/*! @} */

