rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/*! @name REG_A123_120 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A123_120_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A123_120_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A123_120_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A123_120_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A123_120_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A123_120_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A123_120_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A123_120_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A123_120_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A123_120_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A123_120_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A123_120_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A123_120_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A123_120_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A123_120_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A123_120_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A123_120_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A123_120_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A123_120_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A123_120_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A123_120_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A123_120_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A123_120_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A123_120_PAD_3_MASK)
/*! @} */

/*! @name REG_A127_124 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A127_124_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A127_124_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A127_124_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A127_124_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A127_124_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A127_124_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A127_124_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A127_124_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A127_124_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A127_124_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A127_124_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A127_124_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A127_124_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A127_124_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A127_124_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A127_124_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A127_124_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A127_124_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A127_124_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A127_124_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A127_124_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A127_124_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A127_124_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A127_124_PAD_3_MASK)
/*! @} */

/*! @name REG_A131_128 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A131_128_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A131_128_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A131_128_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A131_128_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A131_128_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A131_128_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A131_128_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A131_128_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A131_128_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A131_128_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A131_128_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A131_128_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A131_128_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A131_128_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A131_128_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A131_128_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A131_128_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A131_128_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A131_128_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A131_128_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A131_128_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A131_128_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A131_128_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A131_128_PAD_3_MASK)
/*! @} */

/*! @name REG_A135_132 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A135_132_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A135_132_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A135_132_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A135_132_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A135_132_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A135_132_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A135_132_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A135_132_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A135_132_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A135_132_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A135_132_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A135_132_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A135_132_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A135_132_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A135_132_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A135_132_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A135_132_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A135_132_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A135_132_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A135_132_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A135_132_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A135_132_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A135_132_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A135_132_PAD_3_MASK)
/*! @} */

/*! @name REG_A139_136 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A139_136_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A139_136_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A139_136_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A139_136_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A139_136_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A139_136_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A139_136_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A139_136_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A139_136_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A139_136_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A139_136_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A139_136_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A139_136_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A139_136_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A139_136_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A139_136_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A139_136_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A139_136_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A139_136_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A139_136_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A139_136_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A139_136_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A139_136_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A139_136_PAD_3_MASK)
/*! @} */

/*! @name REG_A143_140 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A143_140_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A143_140_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A143_140_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A143_140_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A143_140_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A143_140_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A143_140_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A143_140_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A143_140_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A143_140_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A143_140_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A143_140_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A143_140_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A143_140_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A143_140_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A143_140_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A143_140_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A143_140_PAD_3_MASK)
/*! @} */

