rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/*! @name REG_A147_144 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A147_144_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A147_144_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A147_144_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A147_144_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A147_144_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A147_144_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A147_144_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A147_144_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A147_144_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A147_144_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A147_144_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A147_144_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A147_144_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A147_144_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A147_144_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A147_144_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A147_144_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A147_144_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A147_144_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A147_144_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A147_144_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A147_144_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A147_144_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A147_144_PAD_3_MASK)
/*! @} */

/*! @name REG_A151_148 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A151_148_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A151_148_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A151_148_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A151_148_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A151_148_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A151_148_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A151_148_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A151_148_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A151_148_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A151_148_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A151_148_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A151_148_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A151_148_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A151_148_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A151_148_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A151_148_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A151_148_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A151_148_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A151_148_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A151_148_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A151_148_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A151_148_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A151_148_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A151_148_PAD_3_MASK)
/*! @} */

/*! @name REG_A155_152 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A155_152_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A155_152_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A155_152_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A155_152_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A155_152_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A155_152_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A155_152_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A155_152_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A155_152_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A155_152_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A155_152_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A155_152_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A155_152_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A155_152_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A155_152_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A155_152_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A155_152_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A155_152_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A155_152_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A155_152_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A155_152_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A155_152_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A155_152_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A155_152_PAD_3_MASK)
/*! @} */

/*! @name REG_A159_156 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A159_156_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A159_156_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A159_156_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A159_156_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A159_156_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A159_156_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A159_156_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A159_156_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A159_156_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A159_156_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A159_156_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A159_156_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A159_156_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A159_156_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A159_156_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A159_156_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A159_156_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A159_156_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A159_156_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A159_156_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A159_156_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A159_156_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A159_156_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A159_156_PAD_3_MASK)
/*! @} */

/*! @name REG_A163_160 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A163_160_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A163_160_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A163_160_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A163_160_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A163_160_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A163_160_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A163_160_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A163_160_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A163_160_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A163_160_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A163_160_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A163_160_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A163_160_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A163_160_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A163_160_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A163_160_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A163_160_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A163_160_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A163_160_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A163_160_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A163_160_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A163_160_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A163_160_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A163_160_PAD_3_MASK)
/*! @} */

/*! @name REG_A167_164 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A167_164_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A167_164_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A167_164_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A167_164_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A167_164_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A167_164_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A167_164_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A167_164_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A167_164_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A167_164_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A167_164_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A167_164_PAD_1_MASK)

