rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_A167_164_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A167_164_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A167_164_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A167_164_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A167_164_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A167_164_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A167_164_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A167_164_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A167_164_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A167_164_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A167_164_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A167_164_PAD_3_MASK)
/*! @} */

/*! @name REG_A171_168 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A171_168_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A171_168_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A171_168_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A171_168_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A171_168_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A171_168_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A171_168_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A171_168_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A171_168_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A171_168_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A171_168_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A171_168_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A171_168_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A171_168_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A171_168_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A171_168_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A171_168_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A171_168_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A171_168_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A171_168_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A171_168_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A171_168_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A171_168_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A171_168_PAD_3_MASK)
/*! @} */

/*! @name REG_A175_172 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A175_172_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A175_172_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A175_172_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A175_172_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A175_172_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A175_172_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A175_172_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A175_172_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A175_172_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A175_172_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A175_172_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A175_172_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A175_172_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A175_172_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A175_172_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A175_172_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A175_172_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A175_172_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A175_172_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A175_172_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A175_172_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A175_172_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A175_172_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A175_172_PAD_3_MASK)
/*! @} */

/*! @name REG_A179_176 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A179_176_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A179_176_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A179_176_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A179_176_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A179_176_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A179_176_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A179_176_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A179_176_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A179_176_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A179_176_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A179_176_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A179_176_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A179_176_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A179_176_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A179_176_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A179_176_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A179_176_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A179_176_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A179_176_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A179_176_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A179_176_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A179_176_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A179_176_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A179_176_PAD_3_MASK)
/*! @} */

/*! @name REG_A183_180 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A183_180_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A183_180_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A183_180_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A183_180_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A183_180_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A183_180_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A183_180_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A183_180_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A183_180_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A183_180_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A183_180_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A183_180_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A183_180_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A183_180_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A183_180_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A183_180_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A183_180_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A183_180_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A183_180_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A183_180_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A183_180_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A183_180_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A183_180_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A183_180_PAD_3_MASK)
/*! @} */

/*! @name REG_A187_184 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A187_184_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A187_184_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A187_184_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A187_184_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A187_184_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A187_184_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A187_184_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A187_184_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A187_184_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A187_184_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A187_184_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A187_184_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A187_184_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A187_184_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A187_184_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A187_184_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A187_184_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A187_184_PAD_2_MASK)

