rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_A187_184_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A187_184_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A187_184_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A187_184_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A187_184_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A187_184_PAD_3_MASK)
/*! @} */

/*! @name REG_A191_188 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A191_188_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A191_188_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A191_188_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A191_188_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A191_188_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A191_188_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A191_188_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A191_188_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A191_188_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A191_188_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A191_188_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A191_188_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A191_188_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A191_188_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A191_188_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A191_188_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A191_188_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A191_188_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A191_188_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A191_188_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A191_188_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A191_188_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A191_188_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A191_188_PAD_3_MASK)
/*! @} */

/*! @name REG_A195_192 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A195_192_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A195_192_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A195_192_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A195_192_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A195_192_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A195_192_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A195_192_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A195_192_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A195_192_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A195_192_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A195_192_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A195_192_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A195_192_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A195_192_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A195_192_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A195_192_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A195_192_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A195_192_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A195_192_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A195_192_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A195_192_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A195_192_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A195_192_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A195_192_PAD_3_MASK)
/*! @} */

/*! @name REG_A199_196 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A199_196_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A199_196_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A199_196_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A199_196_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A199_196_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A199_196_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A199_196_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A199_196_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A199_196_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A199_196_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A199_196_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A199_196_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A199_196_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A199_196_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A199_196_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A199_196_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A199_196_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A199_196_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A199_196_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A199_196_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A199_196_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A199_196_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A199_196_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A199_196_PAD_3_MASK)
/*! @} */

/*! @name REG_A203_200 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A203_200_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A203_200_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A203_200_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A203_200_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A203_200_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A203_200_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A203_200_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A203_200_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A203_200_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A203_200_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A203_200_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A203_200_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A203_200_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A203_200_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A203_200_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A203_200_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A203_200_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A203_200_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A203_200_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A203_200_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A203_200_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A203_200_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A203_200_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A203_200_PAD_3_MASK)
/*! @} */

/*! @name REG_A207_204 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A207_204_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A207_204_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A207_204_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A207_204_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A207_204_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A207_204_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A207_204_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A207_204_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A207_204_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A207_204_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A207_204_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A207_204_PAD_1_MASK)

