rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_A207_204_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A207_204_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A207_204_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A207_204_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A207_204_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A207_204_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A207_204_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A207_204_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A207_204_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A207_204_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A207_204_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A207_204_PAD_3_MASK)
/*! @} */

/*! @name REG_A211_208 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A211_208_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A211_208_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A211_208_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A211_208_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A211_208_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A211_208_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A211_208_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A211_208_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A211_208_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A211_208_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A211_208_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A211_208_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A211_208_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A211_208_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A211_208_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A211_208_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A211_208_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A211_208_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A211_208_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A211_208_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A211_208_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A211_208_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A211_208_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A211_208_PAD_3_MASK)
/*! @} */

/*! @name REG_A215_212 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A215_212_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A215_212_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A215_212_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A215_212_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A215_212_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A215_212_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A215_212_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A215_212_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A215_212_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A215_212_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A215_212_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A215_212_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A215_212_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A215_212_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A215_212_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A215_212_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A215_212_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A215_212_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A215_212_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A215_212_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A215_212_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A215_212_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A215_212_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A215_212_PAD_3_MASK)
/*! @} */

/*! @name REG_A219_216 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A219_216_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A219_216_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A219_216_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A219_216_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A219_216_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A219_216_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A219_216_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A219_216_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A219_216_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A219_216_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A219_216_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A219_216_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A219_216_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A219_216_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A219_216_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A219_216_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A219_216_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A219_216_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A219_216_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A219_216_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A219_216_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A219_216_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A219_216_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A219_216_PAD_3_MASK)
/*! @} */

/*! @name REG_A223_220 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A223_220_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A223_220_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A223_220_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A223_220_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A223_220_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A223_220_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A223_220_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A223_220_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A223_220_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A223_220_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A223_220_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A223_220_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A223_220_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A223_220_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A223_220_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A223_220_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A223_220_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A223_220_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A223_220_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A223_220_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A223_220_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A223_220_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A223_220_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A223_220_PAD_3_MASK)
/*! @} */

