rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/*! @name REG_A227_224 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A227_224_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A227_224_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A227_224_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A227_224_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A227_224_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A227_224_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A227_224_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A227_224_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A227_224_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A227_224_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A227_224_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A227_224_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A227_224_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A227_224_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A227_224_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A227_224_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A227_224_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A227_224_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A227_224_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A227_224_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A227_224_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A227_224_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A227_224_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A227_224_PAD_3_MASK)
/*! @} */

/*! @name REG_A231_228 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A231_228_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A231_228_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A231_228_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A231_228_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A231_228_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A231_228_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A231_228_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A231_228_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A231_228_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A231_228_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A231_228_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A231_228_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A231_228_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A231_228_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A231_228_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A231_228_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A231_228_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A231_228_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A231_228_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A231_228_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A231_228_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A231_228_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A231_228_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A231_228_PAD_3_MASK)
/*! @} */

/*! @name REG_A235_232 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A235_232_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A235_232_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A235_232_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A235_232_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A235_232_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A235_232_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A235_232_PAD_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_A235_232_PAD_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_A235_232_PAD_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A235_232_PAD_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A235_232_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A235_232_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A235_232_PAD_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_A235_232_PAD_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_A235_232_PAD_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A235_232_PAD_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A235_232_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A235_232_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A235_232_PAD_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_A235_232_PAD_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_A235_232_PAD_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A235_232_PAD_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A235_232_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A235_232_PAD_3_MASK)
/*! @} */

/*! @name REG_A239_236 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A239_236_PAD_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_A239_236_PAD_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_A239_236_PAD_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_A239_236_PAD_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A239_236_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A239_236_PAD_0_MASK)
/*! @} */

/*! @name REG_B3_0 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B3_0_INMUX_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B3_0_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B3_0_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B3_0_INMUX_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B3_0_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B3_0_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B3_0_INMUX_2_MASK       (0x70000U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_2_SHIFT      (16U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_2_WIDTH      (3U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_2(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B3_0_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B3_0_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B3_0_INMUX_3_MASK       (0x7000000U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_3_SHIFT      (24U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_3_WIDTH      (3U)
#define VIRT_WRAPPER_REG_B3_0_INMUX_3(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B3_0_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B3_0_INMUX_3_MASK)
/*! @} */

/*! @name REG_B7_4 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B7_4_INMUX_0_MASK       (0x7U)
#define VIRT_WRAPPER_REG_B7_4_INMUX_0_SHIFT      (0U)
#define VIRT_WRAPPER_REG_B7_4_INMUX_0_WIDTH      (3U)
#define VIRT_WRAPPER_REG_B7_4_INMUX_0(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B7_4_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B7_4_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B7_4_INMUX_1_MASK       (0x700U)
#define VIRT_WRAPPER_REG_B7_4_INMUX_1_SHIFT      (8U)
#define VIRT_WRAPPER_REG_B7_4_INMUX_1_WIDTH      (3U)
#define VIRT_WRAPPER_REG_B7_4_INMUX_1(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B7_4_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B7_4_INMUX_1_MASK)
/*! @} */

/*! @name REG_B19_16 - Parameter_n Register */
/*! @{ */

