rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B35_32_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B35_32_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B35_32_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B35_32_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B35_32_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B35_32_INMUX_3_MASK)
/*! @} */

/*! @name REG_B39_36 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B39_36_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B39_36_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B39_36_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B39_36_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B39_36_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B39_36_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B39_36_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B39_36_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B39_36_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B39_36_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B39_36_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B39_36_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B39_36_INMUX_3_MASK)
/*! @} */

/*! @name REG_B43_40 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B43_40_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B43_40_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B43_40_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B43_40_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B43_40_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B43_40_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B43_40_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B43_40_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B43_40_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B43_40_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B43_40_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B43_40_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B43_40_INMUX_3_MASK)
/*! @} */

/*! @name REG_B47_44 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B47_44_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B47_44_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B47_44_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B47_44_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B47_44_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B47_44_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B47_44_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B47_44_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B47_44_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B47_44_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B47_44_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B47_44_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B47_44_INMUX_3_MASK)
/*! @} */

/*! @name REG_B51_48 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B51_48_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B51_48_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B51_48_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B51_48_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B51_48_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B51_48_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B51_48_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B51_48_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B51_48_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B51_48_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B51_48_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B51_48_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B51_48_INMUX_3_MASK)
/*! @} */

/*! @name REG_B55_52 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B55_52_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B55_52_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B55_52_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B55_52_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B55_52_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B55_52_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B55_52_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B55_52_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B55_52_INMUX_2_MASK)

