rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B55_52_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B55_52_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B55_52_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B55_52_INMUX_3_MASK)
/*! @} */

/*! @name REG_B59_56 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B59_56_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B59_56_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B59_56_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B59_56_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B59_56_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B59_56_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B59_56_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B59_56_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B59_56_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B59_56_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B59_56_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B59_56_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B59_56_INMUX_3_MASK)
/*! @} */

/*! @name REG_B63_60 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B63_60_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B63_60_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B63_60_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B63_60_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B63_60_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B63_60_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B63_60_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B63_60_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B63_60_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B63_60_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B63_60_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B63_60_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B63_60_INMUX_3_MASK)
/*! @} */

/*! @name REG_B67_64 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B67_64_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B67_64_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B67_64_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B67_64_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B67_64_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B67_64_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B67_64_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B67_64_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B67_64_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B67_64_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B67_64_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B67_64_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B67_64_INMUX_3_MASK)
/*! @} */

/*! @name REG_B71_68 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B71_68_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B71_68_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B71_68_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B71_68_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B71_68_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B71_68_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B71_68_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B71_68_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B71_68_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B71_68_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B71_68_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B71_68_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B71_68_INMUX_3_MASK)
/*! @} */

/*! @name REG_B83_80 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B83_80_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B83_80_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B83_80_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B83_80_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B83_80_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B83_80_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B83_80_INMUX_2_MASK     (0x70000U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_2_SHIFT    (16U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_2_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_2(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B83_80_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B83_80_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B83_80_INMUX_3_MASK     (0x7000000U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_3_SHIFT    (24U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_3_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B83_80_INMUX_3(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B83_80_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B83_80_INMUX_3_MASK)
/*! @} */

/*! @name REG_B87_84 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B87_84_INMUX_0_MASK     (0x7U)
#define VIRT_WRAPPER_REG_B87_84_INMUX_0_SHIFT    (0U)
#define VIRT_WRAPPER_REG_B87_84_INMUX_0_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B87_84_INMUX_0(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B87_84_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B87_84_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B87_84_INMUX_1_MASK     (0x700U)
#define VIRT_WRAPPER_REG_B87_84_INMUX_1_SHIFT    (8U)
#define VIRT_WRAPPER_REG_B87_84_INMUX_1_WIDTH    (3U)
#define VIRT_WRAPPER_REG_B87_84_INMUX_1(x)       (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B87_84_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B87_84_INMUX_1_MASK)

