rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B115_112_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B115_112_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B115_112_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B115_112_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B115_112_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B115_112_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B115_112_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B115_112_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B115_112_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B115_112_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B115_112_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B115_112_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B115_112_INMUX_3_MASK)
/*! @} */

/*! @name REG_B119_116 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B119_116_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B119_116_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B119_116_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B119_116_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B119_116_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B119_116_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B119_116_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B119_116_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B119_116_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B119_116_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B119_116_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B119_116_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B119_116_INMUX_3_MASK)
/*! @} */

/*! @name REG_B123_120 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B123_120_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B123_120_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B123_120_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B123_120_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B123_120_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B123_120_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B123_120_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B123_120_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B123_120_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B123_120_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B123_120_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B123_120_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B123_120_INMUX_3_MASK)
/*! @} */

/*! @name REG_B127_124 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B127_124_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B127_124_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B127_124_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B127_124_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B127_124_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B127_124_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B127_124_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B127_124_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B127_124_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B127_124_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B127_124_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B127_124_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B127_124_INMUX_3_MASK)
/*! @} */

/*! @name REG_B131_128 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B131_128_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B131_128_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B131_128_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B131_128_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B131_128_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B131_128_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B131_128_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B131_128_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B131_128_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B131_128_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B131_128_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B131_128_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B131_128_INMUX_3_MASK)
/*! @} */

/*! @name REG_B135_132 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B135_132_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B135_132_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B135_132_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B135_132_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B135_132_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B135_132_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B135_132_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B135_132_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B135_132_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B135_132_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B135_132_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B135_132_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B135_132_INMUX_3_MASK)
/*! @} */

/*! @name REG_B147_144 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B147_144_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B147_144_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B147_144_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B147_144_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B147_144_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B147_144_INMUX_1_MASK)

