rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B147_144_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B147_144_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B147_144_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B147_144_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B147_144_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B147_144_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B147_144_INMUX_3_MASK)
/*! @} */

/*! @name REG_B151_148 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B151_148_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B151_148_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B151_148_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B151_148_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B151_148_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B151_148_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B151_148_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B151_148_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B151_148_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B151_148_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B151_148_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B151_148_INMUX_1_MASK)
/*! @} */

/*! @name REG_B155_152 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B155_152_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B155_152_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B155_152_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B155_152_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B155_152_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B155_152_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B155_152_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B155_152_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B155_152_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B155_152_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B155_152_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B155_152_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B155_152_INMUX_3_MASK)
/*! @} */

/*! @name REG_B159_156 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B159_156_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B159_156_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B159_156_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B159_156_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B159_156_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B159_156_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B159_156_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B159_156_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B159_156_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B159_156_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B159_156_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B159_156_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B159_156_INMUX_3_MASK)
/*! @} */

/*! @name REG_B163_160 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B163_160_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B163_160_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B163_160_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B163_160_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B163_160_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B163_160_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B163_160_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B163_160_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B163_160_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B163_160_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B163_160_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B163_160_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B163_160_INMUX_3_MASK)
/*! @} */

/*! @name REG_B167_164 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B167_164_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B167_164_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B167_164_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B167_164_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B167_164_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B167_164_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B167_164_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B167_164_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B167_164_INMUX_2_MASK)

