rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B167_164_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B167_164_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B167_164_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B167_164_INMUX_3_MASK)
/*! @} */

/*! @name REG_B171_168 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B171_168_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B171_168_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B171_168_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B171_168_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B171_168_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B171_168_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B171_168_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B171_168_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B171_168_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B171_168_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B171_168_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B171_168_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B171_168_INMUX_3_MASK)
/*! @} */

/*! @name REG_B175_172 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B175_172_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B175_172_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B175_172_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B175_172_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B175_172_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B175_172_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B175_172_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B175_172_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B175_172_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B175_172_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B175_172_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B175_172_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B175_172_INMUX_3_MASK)
/*! @} */

/*! @name REG_B179_176 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B179_176_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B179_176_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B179_176_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B179_176_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B179_176_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B179_176_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B179_176_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B179_176_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B179_176_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B179_176_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B179_176_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B179_176_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B179_176_INMUX_3_MASK)
/*! @} */

/*! @name REG_B183_180 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B183_180_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B183_180_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B183_180_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B183_180_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B183_180_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B183_180_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B183_180_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B183_180_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B183_180_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B183_180_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B183_180_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B183_180_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B183_180_INMUX_3_MASK)
/*! @} */

/*! @name REG_B187_184 - Parameter_n Register */
/*! @{ */

