rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B187_184_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B187_184_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B187_184_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B187_184_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B187_184_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B187_184_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B187_184_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B187_184_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B187_184_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B187_184_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B187_184_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B187_184_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B187_184_INMUX_3_MASK)
/*! @} */

/*! @name REG_B191_188 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B191_188_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B191_188_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B191_188_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B191_188_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B191_188_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B191_188_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B191_188_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B191_188_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B191_188_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B191_188_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B191_188_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B191_188_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B191_188_INMUX_3_MASK)
/*! @} */

/*! @name REG_B195_192 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B195_192_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B195_192_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B195_192_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B195_192_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B195_192_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B195_192_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B195_192_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B195_192_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B195_192_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B195_192_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B195_192_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B195_192_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B195_192_INMUX_3_MASK)
/*! @} */

/*! @name REG_B199_196 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B199_196_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B199_196_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B199_196_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B199_196_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B199_196_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B199_196_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B199_196_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B199_196_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B199_196_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B199_196_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B199_196_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B199_196_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B199_196_INMUX_3_MASK)
/*! @} */

/*! @name REG_B203_200 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B203_200_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B203_200_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B203_200_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B203_200_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B203_200_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B203_200_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B203_200_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B203_200_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B203_200_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B203_200_INMUX_2_MASK)
/*! @} */

/*! @name REG_B211_208 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B211_208_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B211_208_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B211_208_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B211_208_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B211_208_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B211_208_INMUX_3_MASK)
/*! @} */

/*! @name REG_B215_212 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B215_212_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B215_212_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B215_212_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B215_212_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B215_212_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B215_212_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B215_212_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B215_212_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B215_212_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B215_212_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B215_212_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B215_212_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B215_212_INMUX_3_MASK)
/*! @} */

/*! @name REG_B219_216 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B219_216_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B219_216_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B219_216_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B219_216_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B219_216_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B219_216_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B219_216_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B219_216_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B219_216_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B219_216_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B219_216_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B219_216_INMUX_1_MASK)

