rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B299_296_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B299_296_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B299_296_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B299_296_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B299_296_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B299_296_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B299_296_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B299_296_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B299_296_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B299_296_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B299_296_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B299_296_INMUX_3_MASK)
/*! @} */

/*! @name REG_B303_300 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B303_300_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B303_300_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B303_300_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B303_300_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B303_300_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B303_300_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B303_300_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B303_300_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B303_300_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B303_300_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B303_300_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B303_300_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B303_300_INMUX_3_MASK)
/*! @} */

/*! @name REG_B307_304 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B307_304_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B307_304_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B307_304_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B307_304_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B307_304_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B307_304_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B307_304_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B307_304_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B307_304_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B307_304_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B307_304_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B307_304_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B307_304_INMUX_3_MASK)
/*! @} */

/*! @name REG_B311_308 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B311_308_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B311_308_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B311_308_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B311_308_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B311_308_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B311_308_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B311_308_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B311_308_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B311_308_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B311_308_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B311_308_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B311_308_INMUX_1_MASK)
/*! @} */

/*! @name REG_B315_312 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B315_312_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B315_312_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B315_312_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B315_312_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B315_312_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B315_312_INMUX_3_MASK)
/*! @} */

/*! @name REG_B319_316 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B319_316_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B319_316_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B319_316_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B319_316_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B319_316_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B319_316_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B319_316_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B319_316_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B319_316_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B319_316_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B319_316_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B319_316_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B319_316_INMUX_3_MASK)
/*! @} */

