rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/*! @name REG_B323_320 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B323_320_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B323_320_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B323_320_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B323_320_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B323_320_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B323_320_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B323_320_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B323_320_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B323_320_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B323_320_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B323_320_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B323_320_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B323_320_INMUX_3_MASK)
/*! @} */

/*! @name REG_B327_324 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B327_324_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B327_324_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B327_324_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B327_324_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B327_324_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B327_324_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B327_324_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B327_324_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B327_324_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B327_324_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B327_324_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B327_324_INMUX_1_MASK)
/*! @} */

/*! @name REG_B343_340 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B343_340_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B343_340_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B343_340_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B343_340_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B343_340_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B343_340_INMUX_3_MASK)
/*! @} */

/*! @name REG_B347_344 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B347_344_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B347_344_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B347_344_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B347_344_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B347_344_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B347_344_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B347_344_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B347_344_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B347_344_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B347_344_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B347_344_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B347_344_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B347_344_INMUX_3_MASK)
/*! @} */

/*! @name REG_B351_348 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B351_348_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B351_348_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B351_348_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B351_348_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B351_348_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B351_348_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B351_348_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B351_348_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B351_348_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B351_348_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B351_348_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B351_348_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B351_348_INMUX_3_MASK)
/*! @} */

/*! @name REG_B355_352 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B355_352_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B355_352_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B355_352_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B355_352_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B355_352_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B355_352_INMUX_1_MASK)

