rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B355_352_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B355_352_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B355_352_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B355_352_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B355_352_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B355_352_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B355_352_INMUX_3_MASK)
/*! @} */

/*! @name REG_B359_356 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B359_356_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B359_356_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B359_356_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B359_356_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B359_356_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B359_356_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B359_356_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B359_356_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B359_356_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B359_356_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B359_356_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B359_356_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B359_356_INMUX_3_MASK)
/*! @} */

/*! @name REG_B363_360 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B363_360_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B363_360_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B363_360_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B363_360_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B363_360_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B363_360_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B363_360_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B363_360_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B363_360_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B363_360_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B363_360_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B363_360_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B363_360_INMUX_3_MASK)
/*! @} */

/*! @name REG_B367_364 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B367_364_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B367_364_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B367_364_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B367_364_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B367_364_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B367_364_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B367_364_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B367_364_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B367_364_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B367_364_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B367_364_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B367_364_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B367_364_INMUX_3_MASK)
/*! @} */

/*! @name REG_B371_368 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B371_368_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B371_368_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B371_368_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B371_368_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B371_368_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B371_368_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B371_368_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B371_368_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B371_368_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B371_368_INMUX_2_MASK)
/*! @} */

/*! @name REG_B375_372 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B375_372_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B375_372_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B375_372_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B375_372_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B375_372_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B375_372_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B375_372_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B375_372_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B375_372_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B375_372_INMUX_3_MASK)
/*! @} */

