rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
/*! @name REG_B379_376 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B379_376_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B379_376_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B379_376_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B379_376_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B379_376_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B379_376_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B379_376_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B379_376_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B379_376_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B379_376_INMUX_2_MASK)
/*! @} */

/*! @name REG_B391_388 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B391_388_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B391_388_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B391_388_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B391_388_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B391_388_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B391_388_INMUX_1_MASK)
/*! @} */

/*! @name REG_B399_396 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B399_396_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B399_396_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B399_396_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B399_396_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B399_396_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B399_396_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B399_396_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B399_396_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B399_396_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B399_396_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B399_396_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B399_396_INMUX_3_MASK)
/*! @} */

/*! @name REG_B411_408 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B411_408_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B411_408_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B411_408_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B411_408_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B411_408_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B411_408_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B411_408_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B411_408_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B411_408_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B411_408_INMUX_3_MASK)
/*! @} */

/*! @name REG_B415_412 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B415_412_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B415_412_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B415_412_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B415_412_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B415_412_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B415_412_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B415_412_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B415_412_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B415_412_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B415_412_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B415_412_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B415_412_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B415_412_INMUX_3_MASK)
/*! @} */

/*! @name REG_B419_416 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B419_416_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B419_416_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B419_416_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B419_416_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B419_416_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B419_416_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B419_416_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B419_416_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B419_416_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B419_416_INMUX_2_MASK)
/*! @} */

/*! @name REG_B443_440 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B443_440_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B443_440_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B443_440_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B443_440_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B443_440_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B443_440_INMUX_0_MASK)
/*! @} */

/*! @name REG_B451_448 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B451_448_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B451_448_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B451_448_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B451_448_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B451_448_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B451_448_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B451_448_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B451_448_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B451_448_INMUX_2_MASK)

