rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B451_448_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B451_448_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B451_448_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B451_448_INMUX_3_MASK)
/*! @} */

/*! @name REG_B455_452 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B455_452_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B455_452_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B455_452_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B455_452_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B455_452_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B455_452_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B455_452_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B455_452_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B455_452_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B455_452_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B455_452_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B455_452_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B455_452_INMUX_3_MASK)
/*! @} */

/*! @name REG_B459_456 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B459_456_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B459_456_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B459_456_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B459_456_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B459_456_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B459_456_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B459_456_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B459_456_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B459_456_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B459_456_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B459_456_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B459_456_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B459_456_INMUX_3_MASK)
/*! @} */

/*! @name REG_B463_460 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B463_460_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B463_460_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B463_460_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B463_460_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B463_460_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B463_460_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B463_460_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B463_460_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B463_460_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B463_460_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B463_460_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B463_460_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B463_460_INMUX_3_MASK)
/*! @} */

/*! @name REG_B467_464 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B467_464_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B467_464_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B467_464_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B467_464_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B467_464_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B467_464_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B467_464_INMUX_2_MASK   (0x70000U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_2_SHIFT  (16U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_2_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_2(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B467_464_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B467_464_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B467_464_INMUX_3_MASK   (0x7000000U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_3_SHIFT  (24U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_3_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B467_464_INMUX_3(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B467_464_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B467_464_INMUX_3_MASK)
/*! @} */

/*! @name REG_B471_468 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B471_468_INMUX_0_MASK   (0x7U)
#define VIRT_WRAPPER_REG_B471_468_INMUX_0_SHIFT  (0U)
#define VIRT_WRAPPER_REG_B471_468_INMUX_0_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B471_468_INMUX_0(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B471_468_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B471_468_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B471_468_INMUX_1_MASK   (0x700U)
#define VIRT_WRAPPER_REG_B471_468_INMUX_1_SHIFT  (8U)
#define VIRT_WRAPPER_REG_B471_468_INMUX_1_WIDTH  (3U)
#define VIRT_WRAPPER_REG_B471_468_INMUX_1(x)     (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B471_468_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B471_468_INMUX_1_MASK)
/*! @} */

/*! @name REG_C - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_C_INTC_CTRL_MASK        (0x7U)
#define VIRT_WRAPPER_REG_C_INTC_CTRL_SHIFT       (0U)
#define VIRT_WRAPPER_REG_C_INTC_CTRL_WIDTH       (3U)
#define VIRT_WRAPPER_REG_C_INTC_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_C_INTC_CTRL_SHIFT)) & VIRT_WRAPPER_REG_C_INTC_CTRL_MASK)
/*! @} */

/*! @name REG_D - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_D_REG_GCR_MASK          (0x7U)
#define VIRT_WRAPPER_REG_D_REG_GCR_SHIFT         (0U)
#define VIRT_WRAPPER_REG_D_REG_GCR_WIDTH         (3U)
#define VIRT_WRAPPER_REG_D_REG_GCR(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_D_REG_GCR_SHIFT)) & VIRT_WRAPPER_REG_D_REG_GCR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group VIRT_WRAPPER_Register_Masks */

/*!
 * @}
 */ /* end of group VIRT_WRAPPER_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K388_VIRT_WRAPPER_H_) */
